---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.NumberOfUGridlines
source: html/3c74565b-6322-14ed-26b0-c6fc85f6d2e8.htm
---
# Autodesk.Revit.DB.DividedSurface.NumberOfUGridlines Property

Get the number of U-gridlines used on the
surface.

## Syntax (C#)
```csharp
public int NumberOfUGridlines { get; }
```